trade/src/DataProcessors/ИнтеграцияС1СДокументооборот3/ИнтеграцияС1СДокументооборот3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияС1СДокументооборот3</name>
  <comment>Интеграция с 1С:Документооборотом редакции 3</comment>
</mdclass:DataProcessor>

trade/src/InformationRegisters/ДанныеУзлов1СДокументооборота/ДанныеУзлов1СДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеУзлов1СДокументооборота</name>
  <resources>
    <name>АдресВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресХостаВнешнихНавигационныхСсылок</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипРасположенияХостаВнешнихНавигационныхСсылок</name>
    <type>
      <types>EnumRef.ТипыРасположенияИнформационнойБазы</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/DataProcessors/ИнтеграцияС1СДокументооборот3/Forms/ПодключениеКУзлу/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВебСервиса = Параметры.АдресВебСервиса;
	ИдентификаторУзла = Параметры.ИдентификаторУзла;
	ИмяУзла = Параметры.ИмяУзла;
	
	Если Не ПустаяСтрока(ИмяУзла) Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Подключение к узлу %1'"), ИмяУзла);
		Элементы.ПояснениеАдресВебСервиса.Заголовок =
			СтрШаблон(НСтр("ru = 'Адрес, по которому опубликован веб-сервис узла %1.'"), ИмяУзла);
	КонецЕсли;
	
	ИмяПользователяИБ =
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИмяПользователяИБДляАвторизацииВДО(
			Пользователи.ТекущийПользователь());
#Если Не ВебКлиент Тогда
	Если Не ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
		// Добавим в список выбора имя пользователя ИС.
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		ИмяПользователяИБ = ПользовательИБ.Имя;
	КонецЕсли;
#КонецЕсли
	
	Если ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
		// Добавим в список выбора имя пользователя ИС.
		Элементы.ИмяПользователя.СписокВыбора.Добавить(ИмяПользователяИБ);
		Элементы.ИмяПользователя.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключиться(Команда)
	
	Закрыть(ПодключитьсяНаСервере());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодключитьсяНаСервере()
	
	НастройкиАвторизации =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте();
	НастройкиАвторизации.ИмяПользователя = ИмяПользователя;
	НастройкиАвторизации.Пароль = Пароль;
	НастройкиАвторизации.ИспользуетсяАутентификацияОС = Ложь;
	НастройкиАвторизации.ИспользуетсяАутентификацияJWT = Ложь;
	НастройкиАвторизации.ИспользоватьКеш = Ложь;
	
	ВызыватьИсключение = Истина;
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПолучитьПрокси(
		ВызыватьИсключение,
		НастройкиАвторизации,
		АдресВебСервиса,,
		Истина);
	
	Запрос = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMGetThisNodeRequest");
	Ответ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Ответ);
	
	Если Ответ.node.objectID.id <> ИдентификаторУзла Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'По адресу ""%1"" опубликован узел ""%2"". Требуется указать адрес публикации узла ""%3"".'"),
			АдресВебСервиса,
			Ответ.node.name,
			ИмяУзла);
	КонецЕсли;
	
	ДанныеУзла = РегистрыСведений.ДанныеУзлов1СДокументооборота.НовыеДанныеУзла();
	ДанныеУзла.АдресВебСервиса = АдресВебСервиса;
	
	РегистрыСведений.ДанныеУзлов1СДокументооборота.УстановитьДанныеУзла(ИдентификаторУзла, ДанныеУзла);
	
	Возврат ДанныеУзла;
	
КонецФункции

#КонецОбласти
